#include "main.h"
using namespace std;
/*
ƒано число K (> 0) и указатели P1 и P2 на первый и последний элементы непустого двусв€зного списка.
ќсуществить циклический сдвиг элементов списка на K позиций вперед (то есть в направлении от начала 
к концу списка) и вывести указатели на первый и последний элементы полученного списка. ƒл€ 
выполнени€ циклического сдвига преобразовать исходный список в циклический, после чего Ђразорватьї
его в позиции, соответствующей данному значению K. ќперации выделени€ и освобождени€ пам€ти не 
использовать
*/
void hard()
{
	system("cls");
	cout << "\nHard tasklevel: \n";

	cout << "\nPress Enter to exit...\n";
	while (getchar() != '\n')
		continue;
}
